Repository: Biruk-gebru/Dube
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: Dube
am: ዱቤ

source: Dark Mode
am: ጥቁር ሁነታ

source: Language
am: ቋንቋ

source: English
am: እንግሊዘኛ

source: Amharic
am: አማርኛ

source: Settings
am: ማስተካከያዎች

source: Profile
am: መገለጫ

source: Logout
am: ውጣ

source: Close
am: ዝጋ

source: Products
am: ምርቶች

source: Customers
am: ደንበኞች

source: Reconciliation
am: እርቅ

source: Summary
am: ማጠቃለያ

source: My Customers
am: የእኔ ደንበኞች

source: Add Customers
am: ደንበኞችን ጨምር

source: No products yet
am: እስካሁን ምንም ምርቶች የሉም

source: No customers yet
am: እስካሁን ምንም ደንበኞች የሉም

source: Add Product
am: ምርት ጨምር

source: Edit Product
am: ምርት አርትዕ

source: Delete Product
am: ምርት ሰርዝ

# confirmDeleteProduct
source: Are you sure you want to delete {name}?
am: {name}ን መሰረዝ እርግጠኛ ነዎት?

source: Name
am: ስም

source: Stock
am: ክምችት

source: Price
am: ዋጋ

source: Cancel
am: ተወው

source: Add
am: ጨምር

source: Save
am: አስቀምጥ

source: Delete
am: አጥፋ

# pleaseEnterName
source: Please enter a name
am: እባክዎ ስም ያስገቡ

# pleaseEnterStock
source: Please enter stock quantity
am: እባክዎ የክምችት መጠን ያስገቡ

# pleaseEnterValidNumber
source: Please enter a valid number
am: እባክዎ ትክክለኛ ቁጥር ያስገቡ

# pleaseEnterPrice
source: Please enter a price
am: እባክዎ ዋጋ ያስገቡ

# errorLoadingProducts
source: Error loading products: {error}
am: ምርቶችን በመጫን ላይ ስህተት: {error}

# errorAddingProduct
source: Error adding product: {error}
am: ምርት በመጨመር ላይ ስህተት: {error}

# errorUpdatingProduct
source: Error updating product: {error}
am: ምርት በማዘመን ላይ ስህተት: {error}

# errorDeletingProduct
source: Error deleting product: {error}
am: ምርት በመሰረዝ ላይ ስህተት: {error}

# confirmDeleteCustomer
source: Are you sure you want to remove {name} from your customers?
am: {name}ን ከደንበኞችዎ ለማስወገድ እርግጠኛ ነዎት?

# customerRemoved
source: {name} removed from customers
am: {name} ከደንበኞች ተወግዷል

# errorRemovingCustomer
source: Error removing customer: {error}
am: ደንበኛን በማስወገድ ላይ ስህተት: {error}

source: Search Users
am: ተጠቃሚዎችን ይፈልጉ

source: No users found
am: ምንም ተጠቃሚዎች አልተገኙም

# noUsersMatchSearch
source: No users match your search
am: ፍለጋዎን የሚዛመዱ ተጠቃሚዎች የሉም

source: Customer
am: ደንበኛ

source: Confirm
am: አረጋግጥ

source: Add Transaction
am: ግብይት ጨምር

# errorAddingTransaction
source: Failed to add transaction: {error}
am: ግብይት ማከል አልተቻለም: {error}

source: Transaction added successfully
am: ግብይት በተሳካ ሁኔታ ተጨምሯል

# failedToAddTransaction
source: Failed to add transaction. Please try again.
am: ግብይት መጨመር አልተሳካም። እባክዎ እንደገና ይሞክሩ።

source: Edit Customer
am: ደንበኛን አርትዕ

source: Delete Customer
am: ደንበኛ ሰርዝ

source: Add Customer
am: ደንበኛ ጨምር

source: Phone Number
am: ስልክ ቁጥር

source: Update
am: አዘምን

# errorUpdatingCustomer
source: Error updating customer: {error}
am: ደንበኛን በማዘመን ላይ ስህተት: {error}

# errorDeletingCustomer
source: Error deleting customer: {error}
am: ደንበኛን በመሰረዝ ላይ ስህተት: {error}

# errorAddingCustomer
source: Error adding customer: {error}
am: ደንበኛን በመጨመር ላይ ስህተት: {error}

# errorLoadingCustomers
source: Error loading customers: {error}
am: ደንበኞችን በመጫን ላይ ስህተት: {error}

# customerAlreadyExists
source: {name} is already your customer
am: {name} አስቀድሞ ደንበኛዎ ነው

# customerAdded
source: {name} added as a customer
am: {name} እንደ ደንበኛ ተጨምሯል

# transactionWith
source: Transaction with {name}
am: ከ{name} ጋር ግብይት

source: Select Product to Buy
am: ለመግዛት ምርት ይምረጡ

source: Select Product to Sell
am: ለመሸጥ ምርት ይምረጡ

source: Quantity
am: ብዛት

source: Price per unit
am: በአንድ ዋጋ

source: Buy
am: ግዛ

source: Sell
am: ሽጥ

# noProductsFromCustomer
source: No products available from this customer
am: ከዚህ ደንበኛ የሚገኝ ምንም ምርት የለም

# noProductsToSell
source: You have no products to sell
am: ለመሸጥ ምንም ምርቶች የሎትም

source: Error: User not logged in
am: ስህተት: ተጠቃሚው አልገባም

# stockInfo
source: Stock: {stock} | Sold: {sold} | Price: ${price}
am: ክምችት: {stock} | የተሸጠ: {sold} | ዋጋ: ${price}

source: Product added successfully
am: ምርት በተሳካ ሁኔታ ተጨምሯል

source: Product updated successfully
am: ምርት በተሳካ ሁኔታ ተዘምኗል

source: Product deleted successfully
am: ምርት በተሳካ ሁኔታ ተሰርዟል

# addTransactionTooltip
source: Add Transaction
am: ግብይት ጨምር

source: Total Transactions
am: ጠቅላላ ግብይቶች

source: Matched Transactions
am: የተዛመዱ ግብይቶች

source: Mismatched Transactions
am: ያልተዛመዱ ግብይቶች

source: Total Amount
am: ጠቅላላ መጠን

source: Transaction Statistics
am: የግብይት ስታትስቲክስ

source: Transaction Status Distribution
am: የግብይት ሁኔታ ስርጭት

source: No transactions yet
am: እስካሁን ምንም ግብይቶች የሉም

# buyingTransaction
source: {product} - Buying
am: {product} - መግዛት

# sellingTransaction
source: {product} - Selling
am: {product} - መሸጥ

# customerLabel
source: Customer: {name}
am: ደንበኛ: {name}

# quantityAndPrice
source: Quantity: {quantity} | Price: ${price}
am: ብዛት: {quantity} | ዋጋ: ${price}

# dateLabel
source: Date: {date}
am: ቀን: {date}

source: Matched
am: ተዛምዷል

source: Mismatched
am: አልተዛመደም

source: Pending
am: በመጠባበቅ ላይ

# myCustomersTooltip
source: My Customers
am: የእኔ ደንበኞች

# addCustomersTooltip
source: Add Customers
am: ደንበኞችን ጨምር

source: Transaction Amounts
am: የግብይት መጠኖች

# allTransactionsTooltip
source: All Transactions
am: ሁሉም

# matchedTransactionsTooltip
source: Matched Transactions
am: የተዛመዱ

# mismatchedTransactionsTooltip
source: Mismatched Transactions
am: ያልተዛመዱ

# buyTooltip
source: Buy
am: ግዛ

# sellTooltip
source: Sell
am: ሽጥ

# quantityLabel
source: Quantity
am: ብዛት

# priceLabel
source: Price
am: ዋጋ

# addTransactionButton
source: Add Transaction
am: ግብይት ጨምር

# cancelButton
source: Cancel
am: ሰርዝ

# errorLoadingStatistics
source: Failed to load statistics: {error}
am: ስታትስቲክስ መጫን አልተቻለም: {error}

source: Transaction Classification
am: የግብይት ምደባ

source: All
am: ሁሉም

source: No transactions found
am: ምንም ግብይት አልተገኘም

# cancelAction
source: Cancel
am: ተወው

# deleteAction
source: Remove
am: አስወግድ

# unregistered
source: Not Registered
am: ያልተመዘገበ

# notRegisteredStatus
source: Not Registered
am: ያልተመዘገበ

# unregisteredCustomerTitle
source: Unregistered Customer
am: ያልተመዘገበ ደንበኛ

# unregisteredCustomerStatus
source: Not Registered
am: ያልተመዘገበ

# unregisteredCustomerInfo
source: This customer is not registered in the system. Transactions will remain in pending state.
am: ይህ ደንበኛ በስርዓቱ ውስጥ አልተመዘገበም። ግብይቶች በመጠባበቅ ሁኔታ ይቆያሉ።

# manualTransactionNote
source: Manual Transaction
am: በእጅ የተሰራ ግብይት

# enterManualProduct
source: Enter Product Details
am: የምርት ዝርዝሮችን ያስገቡ

# manualProductName
source: Product Name
am: የምርት ስም

source: Add Unregistered Customer
am: ያልተመዘገበ ደንበኛ ጨምር

# unregisteredTransactionsNote
source: Transactions with unregistered customers remain in pending state
am: ከያልተመዘገቡ ደንበኞች ጋር የሚደረጉ ግብይቶች በመጠባበቅ ሁኔታ ይቆያሉ

# errorLoadingTransactions
source: Error loading transactions: {error}
am: ግብይቶችን በመጫን ላይ ስህተት: {error}

source: Unregistered Transactions
am: ያልተመዘገቡ ግብይቶች

# unregisteredTransactionsTooltip
source: Unregistered Transactions
am: ያልተመዘገቡ ግብይቶች

source: Login
am: ግባ

source: Welcome Back
am: እንኳን ደህና መጡ

source: Email or Username
am: ኢሜይል ወይም የተጠቃሚ ስም

source: Password
am: የይለፍ ቃል

source: Hide password
am: የይለፍ ቃል ደብቅ

source: Show password
am: የይለፍ ቃል አሳይ

source: Sign In
am: ግባ

source: Sign Up
am: ተመዝገብ

# dontHaveAccount
source: Don't have an account? Sign up
am: መለያ የለዎትም? ይመዝገቡ

# loginFailed
source: Login failed. Please check your credentials and try again.
am: መግባት አልተሳካም። እባክዎ መረጃዎችዎን ያረጋግጡና እንደገና ይሞክሩ።

# invalidCredentials
source: Invalid username or email
am: የተሳሳተ የተጠቃሚ ስም ወይም ኢሜይል

source: Create Account
am: መለያ ፍጠር

source: Username
am: የተጠቃሚ ስም

source: Email
am: ኢሜይል

# alreadyHaveAccount
source: Already have an account? Sign In
am: መለያ አለዎት? ይግቡ

# allFieldsRequired
source: All fields are required
am: ሁሉም መስኮች አስፈላጊ ናቸው

# usernameMinLength
source: Username must be at least 3 characters long
am: የተጠቃሚ ስም ቢያንስ 3 ፊደላት መሆን አለበት

# usernameFormat
source: Username can only contain letters, numbers, and underscores
am: የተጠቃሚ ስም ፊደላት፣ ቁጥሮች እና ከስር መስመር ብቻ መሆን አለበት

# invalidEmail
source: Please enter a valid email address
am: እባክዎ ትክክለኛ የኢሜይል አድራሻ ያስገቡ

# passwordMinLength
source: Password must be at least 6 characters long
am: የይለፍ ቃል ቢያንስ 6 ፊደላት መሆን አለበት
